HiMyCocoo/air-quality-monitor/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_AIRMON_SCD41_I2C_PORT_NUM=0
CONFIG_AIRMON_SCD41_I2C_SDA_GPIO=8
CONFIG_AIRMON_SCD41_I2C_SCL_GPIO=9
CONFIG_AIRMON_SPS30_I2C_PORT_NUM=1
CONFIG_AIRMON_SPS30_I2C_SDA_GPIO=17
CONFIG_AIRMON_SPS30_I2C_SCL_GPIO=18
